app/controllers/v1/bookstores_controller.rb

    def set_book_store = @book_store = Bookstore.find(params[:id])
---
SELECT `bookstores`.* FROM `bookstores` WHERE `bookstores`.`id` = 2 LIMIT 1