app/controllers/v1/books_controller.rb

    def index
      json_response(current_user.books.all)
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1

    def create = json_response(current_user.books.create!(book_params))
---
INSERT INTO `books` (`title`, `author`, `created_at`, `updated_at`, `user_id`) VALUES ('Hitchhikers guide to the galaxy', 'Douglas Adams', '2023-04-24 18:56:01.633677', '2023-04-24 18:56:01.633677', 1)

    def update
      @book.update(book_params)
---
UPDATE `books` SET `books`.`title` = 'Shopping', `books`.`updated_at` = '2023-04-24 09:10:09.035764' WHERE `books`.`id` = 103

    def destroy
      @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 123