app/controllers/v1/bookstores_controller.rb

INSERT INTO `bookstores` (`name`, `location`, `created_at`, `updated_at`) VALUES ('Flourish and Blotts', 'London', '2023-04-24 19:16:42.603180', '2023-04-24 19:16:42.603180')
---
    def create = json_response(Bookstore.create!(book_store_params))

SELECT `bookstore_books`.* FROM `bookstore_books` WHERE `bookstore_books`.`bookstore_id` = 1 AND `bookstore_books`.`book_id` = 1 LIMIT 1
---
    def book_list = json_response(BookstoreBook.where(bookstore_id: params[:bookstore_id]))

SELECT `bookstore_books`.* FROM `bookstore_books` WHERE `bookstore_books`.`bookstore_id` = 2 AND `bookstore_books`.`book_id` = 4 LIMIT 1
INSERT INTO `bookstore_books` (`book_id`, `bookstore_id`, `created_at`, `updated_at`) VALUES (4, 2, '2023-04-25 06:49:57.467453', '2023-04-25 06:49:57.467453')
---
    def add_book
      return if BookstoreBook.find_by(bookstore_id: params[:bookstore_id], book_id: params[:book_id])

      json_response(BookstoreBook.create!(book_store_books_params))

SELECT `bookstores`.* FROM `bookstores` WHERE `bookstores`.`id` = 2 LIMIT 1
---
    def set_book_store = @book_store = Bookstore.find(params[:id])