app/serializers/bookstore_serializer.rb

  def books_available
    books = @object.BookstoreBook
    return 'None' if books.size.zero?

    books.map do
---
SELECT COUNT(*) FROM `bookstore_books` WHERE `bookstore_books`.`bookstore_id` = 1
SELECT `bookstore_books`.* FROM `bookstore_books` WHERE `bookstore_books`.`bookstore_id` = 1