app/auth/authenticate_user.rb

  def user
    user = User.find_by(email:)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'foo@bar.ca' LIMIT 1