app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `author`, `created_at`, `updated_at`) VALUES ('hitchhikers guide to the galaxy', 'douglas adams', '2023-04-23 10:39:27.307723', '2023-04-23 10:39:27.307723')
---
  def create = json_response(Book.create!(book_params))

UPDATE `books` SET `books`.`title` = 'Shopping', `books`.`updated_at` = '2023-04-23 15:00:43.879209' WHERE `books`.`id` = 103
---
  def update
    @book.update(book_params)

DELETE FROM `books` WHERE `books`.`id` = 123
---
  def destroy
    @book.destroy