app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('foo', 'foo@bar.ca', '$2a$12$Hh963HS2gqd6wf5fnSz79.6lPMeEsCJJ59Ho0dI/4fcJ8gHO7l.fG', '2023-04-24 18:42:00.071333', '2023-04-24 18:42:00.071333')